# RebarReinforcementData Properties

---
The RebarReinforcementData type exposes the following members.
| Name| Description
---|---|---
| End|  The end of the rebar. The end should be 0 or 1.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from ReinforcementData)
| RebarId|  The id of the Rebar
Top
#### Reference
RebarReinforcementData Class
Autodesk.Revit.DB.Structure Namespace